# Merging DataFrames

In [1]:
import pandas as pd
import numpy as np

In [2]:
products = pd.read_csv('data/data/northwind-mongo-master/products.csv')

In [10]:
products.where(products['ProductName']=='Ravioli Angelo').dropna()

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
56,57.0,Ravioli Angelo,26.0,5.0,24 - 250 g pkgs.,19.5,36.0,0.0,20.0,0.0

In [11]:
categories = pd.read_csv('data/data/northwind-mongo-master/categories1.csv')

In [13]:
categories.loc[categories['CategoryID']==5]

   CategoryID    CategoryName Description
4           5  Grains/Cereals      Breads

In [14]:
suppliers = pd.read_csv('data/data/northwind-mongo-master/suppliers.csv')
suppliers.loc[suppliers['SupplierID']==26]

,SupplierID,CompanyName,ContactName,ContactTitle,Address,City,Region,PostalCode,Country,Phone,Fax,HomePage
25,26,Pasta Buttini s.r.l.,Giovanni Giudici,Order Administrator,Via dei Gelsomini 153,Salerno,NaN,84100,Italy,(089) 6547665,(089) 6547667,NaN

# Concat DataFrames

In [15]:
mrbean = pd.read_csv('data/data/mrbean_facebook_statuses_join.csv',usecols=['status_message_mrbean','status_type','num_likes'])
mrbean.head()

                               status_message_mrbean status_type  num_likes
0  It's time for Mr Bean and Teddy to get ready f...       video      16079
1                                                NaN       photo     114008
2                                                NaN       photo     218579
3  Mr Bean is ready to do some shopping but bewar...       video      20338
4                                                NaN       photo     215591

In [16]:
nasa = pd.read_csv('data/data/nasa_facebook_statuses_join.csv',usecols=['status_message_nasa','status_type','num_likes'])
nasa.head()

                                 status_message_nasa status_type  num_likes
0  This morning, the #RockOn mission with student...       photo       5142
1  Pluto's largest moon, Charon, is home to an un...       photo      19074
2  Our Restore-L mission is an endeavor to launch...       photo       7551
3  A new dark vortex was discovered in the atmosp...       photo      24359
4                                                NaN       video       2731

In [23]:
fb = pd.concat(objs=[mrbean,nasa],sort=True)

In [24]:
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [25]:
fb.tail()

,num_likes,status_message_mrbean,status_message_nasa,status_type
758,39355,NaN,You've never seen Pluto like this before! New ...,photo
759,11835,NaN,Our cooperative field study in East Asia advan...,photo
760,15567,NaN,"After spending a #YearInSpace, astronaut Scott...",photo
761,41584,NaN,"Gravitational waves, predicted by Einstein and...",photo
762,12793,NaN,Have you ever used a GPS to help you get somew...,photo

In [26]:
fb = pd.concat(objs=[mrbean,nasa],sort=True,ignore_index=True)
fb.head()

,num_likes,status_message_mrbean,status_message_nasa,status_type
0,16079,It's time for Mr Bean and Teddy to get ready f...,NaN,video
1,114008,NaN,NaN,photo
2,218579,NaN,NaN,photo
3,20338,Mr Bean is ready to do some shopping but bewar...,NaN,video
4,215591,NaN,NaN,photo

In [27]:
fb.loc[0]

num_likes                                                            16079
status_message_mrbean    It's time for Mr Bean and Teddy to get ready f...
status_message_nasa                                                    NaN
status_type                                                          video
Name: 0, dtype: object

In [31]:
mrbean.rename({'status_message_mrbean':'status_message'},axis=1,inplace=True)
nasa.rename({'status_message_nasa':'status_message'},axis=1,inplace=True)

In [32]:
fb = pd.concat(objs=[mrbean,nasa],sort=True,ignore_index=True)

In [33]:
fb.head()

   num_likes                                     status_message status_type
0      16079  It's time for Mr Bean and Teddy to get ready f...       video
1     114008                                                NaN       photo
2     218579                                                NaN       photo
3      20338  Mr Bean is ready to do some shopping but bewar...       video
4     215591                                                NaN       photo

# Join method

In [34]:
customer_names = pd.read_csv('data/data/northwind-mongo-master/customers.csv',usecols=['CustomerID','CompanyName'])
customer_cities = pd.read_csv('data/data/northwind-mongo-master/customers.csv',usecols=['CustomerID','City','Country'])

In [35]:
len(customer_cities)

91

In [36]:
len(customer_names)

91

In [37]:
customer_cities.set_index('CustomerID',inplace=True)

In [38]:
customer_names.set_index('CustomerID',inplace=True)

In [39]:
customer_names.join(customer_cities).head()

                                   CompanyName          City  Country
CustomerID
ALFKI                      Alfreds Futterkiste        Berlin  Germany
ANATR       Ana Trujillo Emparedados y helados  M?©xico D.F.   Mexico
ANTON                 Antonio Moreno Taquer?­a  M?©xico D.F.   Mexico
AROUT                          Around the Horn        London       UK
BERGS                      Berglunds snabbk?¶p        Lule??   Sweden

In [46]:
customer_city_names = customer_names.join(customer_cities,on='CustomerID')

In [47]:
customer_city_names.head()

                                   CompanyName          City  Country
CustomerID
ALFKI                      Alfreds Futterkiste        Berlin  Germany
ANATR       Ana Trujillo Emparedados y helados  M?©xico D.F.   Mexico
ANTON                 Antonio Moreno Taquer?­a  M?©xico D.F.   Mexico
AROUT                          Around the Horn        London       UK
BERGS                      Berglunds snabbk?¶p        Lule??   Sweden

In [48]:
len(customer_city_names)

91